0.1.0/tutorials/heat-transfer/buoyant-simple/buoyant_cavity/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;

boundaryField
{
  frontAndBack
  {
    type            calculated;
    value           $internalField;
  }
  topAndBottom
  {
    type            calculated;
    value           $internalField;
  }
  hot
  {
    type            calculated;
    value           $internalField;
  }
  cold
  {
    type            calculated;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
