0.1.0/tutorials/heat-transfer/buoyant-simple/buoyant_cavity/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p_rgh
  {
    solver           GAMG;
    tolerance        1e-7;
    relTol           0.01;
    smoother         DICGaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator     faceAreaPair;
    mergeLevels      1;
  }
  "(U|h|k|epsilon|omega)"
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-8;
    relTol          0.1;
  }
}
SIMPLE
{
  momentumPredictor no;
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
  residualControl
  {
    p_rgh           1e-4;
    U               1e-4;
    h               1e-4;
    // possibly check turbulence fields
    "(k|epsilon|omega)" 1e-3;
  }
}
relaxationFactors
{
  fields
  {
    rho             1.0;
    p_rgh           0.7;
  }
  equations
  {
    U               0.3;
    h               0.3;
    "(k|epsilon|omega)" 0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
